
&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	Если ПроверитьЗаполнение() Тогда
		СтруктураЗакрытия =ПолучитьСтруктуруПараметровТранспорта();
		ЗаполнитьЗначенияСвойств(СтруктураЗакрытия, ЭтотОбъект);
		Закрыть(СтруктураЗакрытия);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметровТранспорта()
	Возврат Справочники.Должники.ПолучитьСтруктуруПараметровТранспорта();
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыЗаполнения = "";
	Если Параметры.Свойство("ПараметрыЗаполнения",ПараметрыЗаполнения) тогда
		Для Каждого Элемент из ПараметрыЗаполнения Цикл  
			Если ОбщийМодульПользовательский.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект,Элемент.Ключ) тогда
				ЭтотОбъект[Элемент.Ключ] =Элемент.Значение; 
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	 ОпределитьДоступностьПолей();
КонецПроцедуры


&НаСервере
Процедура ОпределитьДоступностьПолей()

КонецПроцедуры
