
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)

//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
// Данный фрагмент построен конструктором.
// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолгиДолжников.Должник КАК Должник,
	|	ДолгиДолжников.Долг КАК Долг,
	|	ДолгиДолжников.СтатусДолжника КАК СтатусДолжника
	|ИЗ
	|	РегистрСведений.ДолгиДолжников КАК ДолгиДолжников
	|ГДЕ
	|	ДолгиДолжников.Должник В (&СписокДолжник)
	|ИТОГИ
	|ПО
	|	Должник";

Запрос.УстановитьПараметр("СписокДолжник", Строки.ПолучитьКлючи());

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДолжник = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

Пока ВыборкаДолжник.Следующий() Цикл
	// Вставить обработку выборки ВыборкаДолжник

	ВыборкаДетальныеЗаписи = ВыборкаДолжник.Выбрать();
	ОписаниеДолгов ="";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОписаниеДолгов =ОписаниеДолгов+?(ОписаниеДолгов="","",",")+ВыборкаДетальныеЗаписи.Долг+"("
		+ВыборкаДетальныеЗаписи.СтатусДолжника+")";
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	СтрокаДолжников = Строки[ВыборкаДолжник.Должник];
	СтрокаДолжников.данные.Долги = ОписаниеДолгов; 
КонецЦикла;

//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры
