
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика  ,
//	СтуруктураЗаполнения=Новый Структура;
	Если ЗначениеЗаполнено(Параметры.Ключ) тогда 
		Если Параметры.Ключ.Долги.Количество()>0 тогда
		СтрокаПлатежа=Параметры.Ключ.Долги[0];
		ДатаПлатежа =СтрокаПлатежа.ДатаПлатежа;
		Долг =СтрокаПлатежа.Долг;
		Плательщик =СтрокаПлатежа.Плательщик;
        СуммаПлатежа =СтрокаПлатежа.СуммаПлатежа;
		Комментарий = СтрокаПлатежа.Комментарий;
		КонецЕсли;
	иначе 
		ДатаПлатежа =Параметры.ДатаПлатежа;
	Долг =Параметры.Долг;
	Плательщик =Параметры.Плательщик;
	
	КонецЕсли;	
//	ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика  
КонецПроцедуры   

&НаСервере
Функция ВернутьСтрокуПлатежа(Документ)
	Если Документ.Долги.Количество()=0 тогда
		Возврат Документ.Долги.Добавить();
	иначе                        
		Возврат Документ.Долги[0];
	КонецЕсли;	
КонецФункции	

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика 
		СтрокаДолги=ВернутьСтрокуПлатежа(ТекущийОбъект);
	СтрокаДолги.Плательщик=Плательщик;
	СтрокаДолги.Долг = Долг;
	СтрокаДолги.СуммаПлатежа =СуммаПлатежа;
	СтрокаДолги.ДатаПлатежа =ДатаПлатежа;	
	СтрокаДолги.Комментарий =Комментарий;

КонецПроцедуры
