
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика   
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) тогда 

	ЗаполнитьЗначенияСвойств(Объект,Параметры);
	КонецЕсли;
   // 		Плательщик =Параметры.Плательщик;
   // Долг =Параметры.Долг;
   // Плательщик =Параметры.Плательщик;
   //ДатаОбещанногоПлатежа = Параметры.ДатаОбещанногоПлатежа;
   // 		ПараметрыПлатежа =Новый Структура;
   // 		ПараметрыПлатежа.Вставить("Плательщик",Объект.Ссылка);
   // 		ПараметрыПлатежа.Вставить("Долг",Долг);
   // 		ПараметрыПлатежа.Вставить("ДатаОбещанногоПлатежа",ТекущаяДата()+7*60*60*24);
			

КонецПроцедуры
