
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СтатусыРаботыСДолгом
	Движения.СтатусыРаботыСДолгом.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.СтатусыРаботыСДолгом.Добавить();
		Движение.Период = Дата;
		Движение.Долг = ТекСтрокаДолги.Долг;
		Движение.Реестр = ТекСтрокаДолги.Реестр;
		Движение.СтатусРаботыСДолгом = ТекСтрокаДолги.НовыйСтатусРаботыСДолгом;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	Если ОбменДанными.Загрузка Тогда
     Возврат;
КонецЕсли;   
	Если Не ЗначениеЗаполнено(Ссылка) тогда
		Ответственный=ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
КонецПроцедуры


