
&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
		Если ПроверитьЗаполнение() тогда  
		СтруктураЗакрытия =ПолучитьСтруктуруПараметровНевижимости(); 
		ЗаполнитьЗначенияСвойств(СтруктураЗакрытия,ЭтотОбъект);
		Закрыть(СтруктураЗакрытия);     
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметровНевижимости()
	Возврат Справочники.Должники.ПолучитьСтруктуруПараметровНевижимости();
КонецФункции

&НаКлиенте
Процедура АдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
			СтандартнаяОбработка =Ложь;
	 // Вставить содержимое обработчика.  
	ПараметрыОткрытия=Новый Структура;
	ПараметрыОткрытия.Вставить("ОткрытаПоСценарию","");                                                            
	ПараметрыОткрытия.Вставить("Представление",Адрес); 
	ПараметрыОткрытия.Вставить("Значение",АдресЗначение);
	ДопПараметры=Новый Структура;

	ДопПараметры.Вставить("Владелец",Элемент);
	Оповещение= НОвый ОписаниеОповещения("ОбработатьВыборАдреса",ЭтотОбъект,ДопПараметры); 
	
    ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса",ПараметрыОткрытия,Элемент,,,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура АдресОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка =Ложь;
КонецПроцедуры

	
&НаКлиенте
Процедура ОбработатьВыборАдреса(Результат,ДопПарметры) Экспорт  
	Если Результат<>Неопределено тогда
		
		АдресЗначение = Результат.Значение;
		Адрес=Результат.Представление;    
	КонецЕсли;
КонецПроцедуры	  


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыЗаполнения = "";
	Если Параметры.Свойство("ПараметрыЗаполнения",ПараметрыЗаполнения) тогда
		Для Каждого Элемент из ПараметрыЗаполнения Цикл  
			Если ОбщийМодульПользовательский.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект,Элемент.Ключ) тогда
				ЭтотОбъект[Элемент.Ключ] =Элемент.Значение; 
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	 ОпределитьДоступностьПолей();
КонецПроцедуры


&НаКлиенте
Процедура ВидНедвижимостиПриИзменении(Элемент)
	ОпределитьДоступностьПолей();
	ПодвидНедвижимости=Неопределено;
КонецПроцедуры


&НаСервере
Процедура ОпределитьДоступностьПолей()
	СписокВидовНедвижимости = Новый СписокЗначений();
	СписокВидовНедвижимости.Добавить(Перечисления.ВидыНедвижимогоИмуществаДолжника.Гараж);
	СписокВидовНедвижимости.Добавить(Перечисления.ВидыНедвижимогоИмуществаДолжника.НежилыеПомещения);
	СписокВидовНедвижимости.Добавить(Перечисления.ВидыНедвижимогоИмуществаДолжника.ЗемельныйУчасток);
	Если СписокВидовНедвижимости.НайтиПоЗначению(ВидНедвижимости)=Неопределено тогда
		Элементы.ПодвидНедвижимости.Доступность= Ложь;
	иначе
		Элементы.ПодвидНедвижимости.Доступность= Истина;	
	КонецЕсли;	
КонецПроцедуры
