
#Область СлужебныйПрограммныйИнтерфейс

Функция НачатьЗамер(АвтоЗавершение = Истина, Событие, ТолькоНаКлиенте = Истина) Экспорт
	
	Если Не ОценкаПроизводительностиВызовСервераПовтИсп.ВыполнятьЗамерыПроизводительности() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ОценкаПроизводительностиРТВызовСервера.ПроверитьНеобходимостьРегистрацииЗамеров(Событие) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МодульОценкаПроизводительностиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОценкаПроизводительностиКлиент");
	
	Если ТолькоНаКлиенте Тогда		
		Замер = Новый Структура("МодульОценкаПроизводительностиКлиент, Идентификатор");
		Замер.МодульОценкаПроизводительностиКлиент = МодульОценкаПроизводительностиКлиент;
		Замер.Идентификатор = Замер.МодульОценкаПроизводительностиКлиент.ЗамерВремени(Событие, ,АвтоЗавершение);
		Замер.МодульОценкаПроизводительностиКлиент.УстановитьКомментарийЗамера(Замер.Идентификатор, "");
	Иначе
		Замер = МодульОценкаПроизводительностиКлиент.ЗамерВремени(Событие, ,АвтоЗавершение);
	КонецЕсли;
	
	Возврат Замер;
	
КонецФункции

Процедура ЗакончитьЗамер(Замер) Экспорт
	
	Если Замер <> Неопределено Тогда
		
		Если ТипЗнч(Замер) = Тип("Структура") Тогда
			Замер.МодульОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(Замер.Идентификатор);
		Иначе
			ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(Замер);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


