
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика 
	Договор=Неопределено;
	Если Параметры.Свойство("Договор",Договор) тогда  
	Список.Параметры.УстановитьЗначениеПараметра("Договор",Договор);	
	иначе
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.  
	Если Элемент.ТекущиеДанные<>Неопределено тогда
		ПоказатьЗначение( Элемент.ТекущиеДанные.Наименование);
	КонецЕсли;	
КонецПроцедуры
