
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика 
	Договор=Неопределено;
	Если Параметры.Свойство("Договор",Договор) тогда  
	Список.Параметры.УстановитьЗначениеПараметра("Договор",Договор);	
	иначе
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.  
	Если Элемент.ТекущиеДанные<>Неопределено тогда
		ПоказатьЗначение( ,Элемент.ТекущиеДанные.Наименование);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРеестр(Команда)
	Оповещение= НОвый ОписаниеОповещения("ОбработатьЗагрузкуРеестра",ЭтотОбъект); 
	ОткрытьФорму("Обработка.ЗагрузкаДанныхУЗ.Форма.Форма",Новый Структура("ПараметрыЗаполнения",ПолучитьСтруктуруПараметровЗагрузкиРеестра()),ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметровЗагрузкиРеестра()
	СтруктураПараметров = НОвый Структура;
	СтруктураПараметров.Вставить("Контрагент",Договор.Владелец);
	СтруктураПараметров.Вставить("ДоговорКонтрагента",Договор); 
	Возврат СтруктураПараметров;
КонецФункции	

&НаКлиенте
Процедура ОбработатьЗагрузкуРеестра(Результат,ДопПарметры) Экспорт  
  Элементы.Список.Обновить();
КонецПроцедуры
