Функция ПолучитьСтруктуруПараметровСоцСети() Экспорт
	  	
		    НоваяСтрокаСоцСети=Справочники.Должники.ПустаяСсылка().Соцсети.Выгрузить().Добавить();
			ПараметрыОткрытия = ОбщийМодульПользовательский.СтрокаТаблицыЗначенийВСтруктуру(НоваяСтрокаСоцСети);
			 
Возврат ПараметрыОткрытия;
КонецФункции	

Функция ПолучитьСтруктуруПараметровНевижимости() Экспорт
	  	
		    НоваяСтрокаНедвижимость=Справочники.Должники.ПустаяСсылка().Недвижимость.Выгрузить().Добавить();
			ПараметрыОткрытия = ОбщийМодульПользовательский.СтрокаТаблицыЗначенийВСтруктуру(НоваяСтрокаНедвижимость);
			 
Возврат ПараметрыОткрытия;
КонецФункции	

Функция ПолучитьСтруктуруПараметровТранспорта() Экспорт
	  	
		    НоваяСтрокаТранспорт=Справочники.Должники.ПустаяСсылка().Транспорт.Выгрузить().Добавить();
			ПараметрыОткрытия = ОбщийМодульПользовательский.СтрокаТаблицыЗначенийВСтруктуру(НоваяСтрокаТранспорт);
			 
Возврат ПараметрыОткрытия;
КонецФункции	

Функция ПолучитьСтруктуруПараметровМестаРаботы() Экспорт
	  	
		    НоваяСтрокаМестоРаботы=Справочники.Должники.ПустаяСсылка().МестаРаботы.Выгрузить().Добавить();
			ПараметрыОткрытия = ОбщийМодульПользовательский.СтрокаТаблицыЗначенийВСтруктуру(НоваяСтрокаМестоРаботы);
			 
Возврат ПараметрыОткрытия;
КонецФункции	