#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("СтруктурнаяЕдиница") Тогда
		Если ТипЗнч(Параметры.Отбор.СтруктурнаяЕдиница) = Тип("СправочникСсылка.Организации") Тогда
			ТекстЗаголовка = "";
			АвтоЗаголовок  = Ложь;
			ТекстЗаголовка = НСтр("ru = 'Ответственные лица организаций (%СтруктурнаяЕдиница%)'");
			ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%СтруктурнаяЕдиница%", Строка(Параметры.Отбор.СтруктурнаяЕдиница));
			Заголовок      = ТекстЗаголовка;
		КонецЕсли;
	КонецЕсли;
	
	//Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") 
	//	ИЛИ Параметры.Отбор.Свойство("СтруктурнаяЕдиница") Тогда
	//	Элементы.СтруктурнаяЕдиница.Видимость = Ложь;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Оповестить("ИзменениеОтветственныхЛиц");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.ОтветственныеЛицаОрганизаций.Форма.ФормаСписка.Открытие");

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.ОтветственныеЛицаОрганизаций.Форма.ФормаЗаписи.Открытие");

КонецПроцедуры

#КонецОбласти