

 

&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		//Вставить содержимое обработчика 
		Параметры.Свойство("Владелец",Владелец);
	//Владелец = Параметры.Владелец;

	Элементы.ВидТелефона.СписокВыбора.ЗагрузитьЗначения(Параметры.СписокВыбораТелефона); 
	Параметры.Свойство("ВидТелефона",ВидТелефона);
	Параметры.Свойство("Телефон",Телефон);
    Параметры.Свойство("ЗначениеТелефона",ЗначениеТелефона);
	КонецПроцедуры


&НаКлиенте
	Процедура Записать(Команда)
		// Вставить содержимое обработчика. 
		Если ПроверитьЗаполнение() тогда
		СтруктураЗакрытия=Новый Структура;
		СтруктураЗакрытия.Вставить("ВидТелефона",ВидТелефона);
		СтруктураЗакрытия.Вставить("ЗначениеТелефона",ЗначениеТелефона);
		СтруктураЗакрытия.Вставить("Телефон",Телефон);
		Закрыть(СтруктураЗакрытия);     
		КонецЕсли;
	КонецПроцедуры

&НаКлиенте
	Процедура ЗакрытьБезСохранения(Команда)
		// Вставить содержимое обработчика.
		Закрыть();
	КонецПроцедуры
