
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	//Если Не Параметры.Свойство("Владелец",Объект.Владелец) тогда   
	//	Отказ = Истина;
	//КонецЕсли;   
	СтатусРаботыСДолгом =ПолучитьСтатусРаботыСДолгом(Объект.Ссылка,ТекущаяДата());
КонецПроцедуры                   

&НаСервере
Функция ПолучитьСтатусРаботыСДолгом(Долг,НаДату)  
	    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыРаботыСДолгомСрезПоследних.СтатусРаботыСДолгом КАК СтатусРаботыСДолгом
		|ИЗ
		|	РегистрСведений.СтатусыРаботыСДолгом.СрезПоследних(&НаДату, Долг = &Долг) КАК СтатусыРаботыСДолгомСрезПоследних";
	
	Запрос.УстановитьПараметр("Долг", Долг);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Результат=Запрос.Выполнить().Выбрать(); 
	Результат.Следующий();
	Возврат Результат.СтатусРаботыСДолгом;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции

&НаКлиенте
Процедура СтатусРаботыСДолгомНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		СтарыйСтатус=СтатусРаботыСДолгом;

КонецПроцедуры

&НаКлиенте
Процедура СтатусРаботыСДолгомПриИзменении(Элемент)
	// Вставить содержимое обработчика.   
		Если СтатусРаботыСДолгом<>СтарыйСтатус тогда
	//Сообщить(Объект.СтатусДействия);              
	ОповещениеВопрос = Новый ОписаниеОповещения("ПослеОтветаСменаСтатуса",ЭтотОбъект);
	ПоказатьВопрос(ОповещениеВопрос,"Сменить статус договора?",РежимДиалогаВопрос.ДаНет);
	
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПослеОтветаСменаСтатуса(Результат, Параметры) Экспорт // здесь, думаю, комментировать нечего
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		//Сообщить("Открываем смену статуса");
		СоздатьДокументСменыСтатуса();
	Иначе
		Объект.СтатусДействия = СтарыйСтатус;
	КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура СтатусДействияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтарыйСтатус=Объект.СтатусДействия;
КонецПроцедуры

&НаКлиенте
Процедура	СоздатьДокументСменыСтатуса()
	ПараметрыЗаполнения=Новый Структура;
	ПараметрыЗаполнения.Вставить("Дата",ТекущаяДата());
	ПараметрыЗаполнения.Вставить("Долг",Объект.Ссылка);
	ПараметрыЗаполнения.Вставить("НовыйСтатусРаботыСДолгом",СтатусРаботыСДолгом);
	ПараметрыЗаполнения.Вставить("ЗаполнитьПриОткрытии",Истина);
	ОткрытьФорму("Документ.СменаСтатусаРаботыСДолгами.Форма.ФормаДокумента",ПараметрыЗаполнения,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры	
