
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	//Если ЭтоНовый() Тогда
	//	ТекущийПользователь = Пользователи.ТекущийПользователь();
	//	Организация   = ЗначениеНастроекПовтИсп.ОрганизацияПоУмолчанию(Организация, ТекущийПользователь);
	//	БанковскийСчет = ЗначениеНастроекПовтИсп.БанковскийСчетОрганизацииПоУмолчанию(Организация, , БанковскийСчет);
	//	ТипДоговора = Перечисления.ТипыДоговоровПлатежныхАгентов.Прямой;
	//	ИспользоватьКомиссионнуюТорговлю = ПолучитьФункциональнуюОпцию("ИспользоватьКомиссионнуюТорговлю");
	//	
	//	Если ИспользоватьКомиссионнуюТорговлю Тогда
	//		ПризнакАгента = Перечисления.ПризнакиАгента.Комиссионер;
	//	Иначе
	//		ПризнакАгента = Перечисления.ПризнакиАгента.ПлатежныйАгент;
	//	КонецЕсли;
	//КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
//	ИННПоставщикаУслуг = ОбщегоНазначенияРТ.ПолучитьИННКонтрагента(Агент);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
