
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика 
	//ЗаполнитьЗначенияСвойств(ЭтотОбъект ,Параметры);
	ПараметрыЗаполнения = "";
	Если Параметры.Свойство("ПараметрыЗаполнения",ПараметрыЗаполнения) тогда
		Для Каждого Элемент из ПараметрыЗаполнения Цикл  
			Если ОбщийМодульПользовательский.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект,Элемент.Ключ) тогда
				ЭтотОбъект[Элемент.Ключ] =Элемент.Значение; 
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры
