
&НаКлиенте
Процедура НаименованиеСоцСетиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗначениеОтбора = Новый Структура("ВидМедиаРесурса",ВидМедиаРесурса);
    ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);

    ОткрытьФорму("Справочник.Соцсети.Форма.ФормаВыбора",ПараметрыВыбора, Элемент); // здесь передан Элемент, чтобы выбранное значение попало в поле
КонецПроцедуры


&НаКлиенте
Процедура Записать(Команда)
	Если ПроверитьЗаполнение() тогда  
		СтруктураЗакрытия =ПолучитьСтруктуруПараметровСоцСети(); 
		ЗаполнитьЗначенияСвойств(СтруктураЗакрытия,ЭтотОбъект);
		Закрыть(СтруктураЗакрытия);     
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметровСоцСети()
	Возврат Справочники.Должники.ПолучитьСтруктуруПараметровСоцСети();
КонецФункции	



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПараметрыЗаполнения = "";
	Если Параметры.Свойство("ПараметрыЗаполнения",ПараметрыЗаполнения) тогда
		Для Каждого Элемент из ПараметрыЗаполнения Цикл  
			Если ОбщийМодульПользовательский.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект,Элемент.Ключ) тогда
				ЭтотОбъект[Элемент.Ключ] =Элемент.Значение; 
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры
