
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка как Договор,
		|	ВЫБОР
		|		КОГДА ДоговорыКонтрагентовПрисоединенныеФайлы.Ссылка ЕСТЬ NULL
		|			ТОГДА ""Нет""
		|		ИНАЧЕ ""Да""
		|	КОНЕЦ КАК СканВерсия,
		|	ВЫБОР
		|		КОГДА ДоговорыКонтрагентовПрисоединенныеФайлыОригинал.Ссылка ЕСТЬ NULL
		|			ТОГДА ""Нет""
		|		ИНАЧЕ ""Да""
		|	КОНЕЦ КАК Оригинал,
		|	ВЫБОР
		|		КОГДА ДоговорыКонтрагентовПрисоединенныеФайлыДопСоглашение.Ссылка ЕСТЬ NULL
		|			ТОГДА ""Нет""
		|		ИНАЧЕ ""Да""
		|	КОНЕЦ КАК ДопСоглашение
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ Соединение Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы КАК ДоговорыКонтрагентовПрисоединенныеФайлы
		|		ПО ДоговорыКонтрагентовПрисоединенныеФайлы.ВладелецФайла = ДоговорыКонтрагентов.Ссылка
		|		И
		|			ДоговорыКонтрагентовПрисоединенныеФайлы.ТипЗагруженногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыЗагруженныхДокументов.СканВерсия)
		|		И
		|			ДоговорыКонтрагентовПрисоединенныеФайлы.ВидЗагруженногоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыЗагруженныхДокументов.Договор)
		|		ЛЕВОЕ Соединение Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы КАК
		|			ДоговорыКонтрагентовПрисоединенныеФайлыОригинал
		|		ПО ДоговорыКонтрагентовПрисоединенныеФайлыОригинал.ВладелецФайла = ДоговорыКонтрагентов.Ссылка
		|		И
		|			ДоговорыКонтрагентовПрисоединенныеФайлыОригинал.ТипЗагруженногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыЗагруженныхДокументов.Оригинал)
		|		И
		|			ДоговорыКонтрагентовПрисоединенныеФайлыОригинал.ВидЗагруженногоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыЗагруженныхДокументов.Договор)
		|		ЛЕВОЕ Соединение Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы КАК
		|			ДоговорыКонтрагентовПрисоединенныеФайлыДопСоглашение
		|		ПО ДоговорыКонтрагентовПрисоединенныеФайлыДопСоглашение.ВладелецФайла = ДоговорыКонтрагентов.Ссылка
		|		И
		|			ДоговорыКонтрагентовПрисоединенныеФайлыДопСоглашение.ВидЗагруженногоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыЗагруженныхДокументов.ДополнительноеСоглашение)
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка В (&СписокДоговоров)";
	
	Запрос.УстановитьПараметр("СписокДоговоров", Строки.ПолучитьКлючи());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		СтрокаСписка=Строки[ВыборкаДетальныеЗаписи.Договор];
	СтрокаСписка.Данные.НаличиеСканВерсии =ВыборкаДетальныеЗаписи.СканВерсия;
	СтрокаСписка.Данные.НаличиеОригинала =ВыборкаДетальныеЗаписи.Оригинал;
	СтрокаСписка.Данные.НаличиеДС =ВыборкаДетальныеЗаписи.ДопСоглашение;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	СУММА(РеестрДолжниковДолжники.СуммаЗадолженности) КАК ОбщаяСуммаЗадолженности,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеестрДолжниковДолжники.Долг) КАК КоличествоПозиций,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеестрДолжниковДолжники.Ссылка) > 0
		|			ТОГДА Истина
		|		ИНАЧЕ Ложь
		|	Конец КАК РеестрЗагружен
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеестрДолжников.Должники КАК РеестрДолжниковДолжники
		|		ПО (РеестрДолжниковДолжники.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка)
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка В (&СписокДоговоров)
		|СГРУППИРОВАТЬ ПО
		|	ДоговорыКонтрагентов.Ссылка";
	
	Запрос.УстановитьПараметр("СписокДоговоров", Строки.ПолучитьКлючи());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СтрокаСписка=Строки[ВыборкаДетальныеЗаписи.Договор];
				ЗаполнитьЗначенияСвойств(СтрокаСписка.Данные, ВыборкаДетальныеЗаписи);
//	СтрокаСписка.Данные.НаличиеСканВерсии =ВыборкаДетальныеЗаписи.СканВерсия;
//	СтрокаСписка.Данные.НаличиеОригинала =ВыборкаДетальныеЗаписи.Оригинал;
//	СтрокаСписка.Данные.НаличиеДС =ВыборкаДетальныеЗаписи.ДопСоглашение;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

&НаКлиенте
Процедура НаличиеСканВерсииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
КонецПроцедуры
